Revit 2017 API
ImportInstance Class
An element created during either import or link operation in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class ImportInstance : Instance
Visual Basic
Public Class ImportInstance _
	Inherits Instance
Visual C++
public ref class ImportInstance : public Instance
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Instance
 Autodesk.Revit.DB.ImportInstance
See Also
ImportInstance Members
Autodesk.Revit.DB Namespace